Tekla.Structures.Drawing.View.ViewTypes
The possible types of views.

Tekla.Structures.Drawing.View.ViewTypes.UnknownViewType
The view type is not known.

Tekla.Structures.Drawing.View.ViewTypes.FrontView
Front side view of the part.

Tekla.Structures.Drawing.View.ViewTypes.TopView
Top side view of the part.

Tekla.Structures.Drawing.View.ViewTypes.BackView
Back side view of the part.

Tekla.Structures.Drawing.View.ViewTypes.BottomView
Bottom side view of the part.

Tekla.Structures.Drawing.View.ViewTypes.EndView
End side view of the part.

Tekla.Structures.Drawing.View.ViewTypes.SectionView
Section view of the part.

Tekla.Structures.Drawing.View.ViewTypes.ModelView
Model view of the part.

Tekla.Structures.Drawing.View.ViewTypes.DetailView
Detail view of the part.

Tekla.Structures.Drawing.View.ViewTypes._3DView
3d view of the part.